src/systemtest/op-monitoring/xrd-opmon-tests/templates/xroad_query_to_ss0_service_template.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://producer.x-road.eu" xmlns:xrd="http://x-road.eu/xsd/xroad.xsd" xmlns:id="http://x-road.eu/xsd/identifiers">
    <SOAP-ENV:Header>
        <xrd:client id:objectType="SUBSYSTEM">
            <id:xRoadInstance>{params[client_instance]}</id:xRoadInstance>
            <id:memberClass>{params[client_class]}</id:memberClass>
            <id:memberCode>{params[client_code]}</id:memberCode>
            <id:subsystemCode>{params[client_system]}</id:subsystemCode>
        </xrd:client>
        <xrd:service id:objectType="SERVICE">
            <id:xRoadInstance>{params[producer2_instance]}</id:xRoadInstance>
            <id:memberClass>{params[producer2_class]}</id:memberClass>
            <id:memberCode>{params[producer2_code]}</id:memberCode>
            <id:subsystemCode>{params[producer2_system]}</id:subsystemCode>
            <id:serviceCode>mock</id:serviceCode>
            <id:serviceVersion>v1</id:serviceVersion>
        </xrd:service>
        <xrd:securityServer id:objectType="SERVER">
            <id:xRoadInstance>{params[producer_instance]}</id:xRoadInstance>
            <id:memberClass>{params[producer_class]}</id:memberClass>
            <id:memberCode>{params[producer_code]}</id:memberCode>
            <id:serverCode>{params[producer_server_code]}</id:serverCode>
        </xrd:securityServer>
        <xrd:protocolVersion>4.0</xrd:protocolVersion>
        <xrd:id>{message_id_placeholder}</xrd:id>
        <xrd:userId>EE12345678901</xrd:userId>
        <xrd:issue>453465</xrd:issue>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:mock>
            <desiredResponse>withServer</desiredResponse>
        </ns1:mock>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
